Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: གང་གིས་དུས་གསུམ་གྱིས་དེ་བཞིན་གཤེགས་པའི་དཀྱིལ་འཁོར་རང་གི་སེམས་དང་བསམ་པར་ཡང་དག་པར་གཞོལ་བས། །སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་དུས་གསུམ་དུ་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called the three times through their own motivations and aspiration conjoining within the domains of the tathāgatas of the three times.

source: གང་གིས་དམིགས་པ་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཡང་དག་པར་ཚོགས་པ་མཐོང་ཞིང་དམིགས་པས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་དམིགས་པར་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called locations through perceiving the vision of the arrival of the succession of the tathāgatas in all locations.

source: གང་གིས་སྐད་ཅིག་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་རྣམ་པར་དམིགས་པས། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཞི་བས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called peace through perceiving in each instant the passing into nirvāṇa of all tathāgatas in all world realms.

source: གང་གིས་ཉིན་གཅིག་ཏུ་གནས་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཤེགས་པར་རྣམ་པར་དམིགས་པས། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་འབྲལ་བས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called separation through perceiving in one day in all places the departure of all the tathāgatas.

source: གང་གིས་དེ་བཞིན་གཤེགས་པ་རེ་རེ་སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་པས་ཀྱང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྒྱས་པར་ཁྱབ་པའི་སངས་རྒྱས་ཀྱི་སྐུ་རྣམ་པར་དམིགས་པས། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཤིན་ཏུ་ཡངས་པས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called vastness through perceiving the body of each tathāgata while sitting cross-legged filling the realm of phenomena.

source: གང་གིས་སྐྲའི་རྩེ་མོ་གཅིག་ལ་སངས་རྒྱས་བརྗོད་དུ་མེད་པ་བྱུང་བ་མཉེས་པར་བྱ་བ་ལ་འཇུག་པས། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ཤིན་ཏུ་ཕྲ་བས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called subtle through discerning the accomplishment of the appearance of countless buddhas on the tip of a single hair.

source: སྐད་ཅིག་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་མངོན་པར་འཚང་རྒྱ་ཞིང་། རྣམ་པར་འཕྲུལ་པ་སྟོན་པ་རྣམ་པར་དམིགས་པས། གང་གིས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་རྒྱན་དུ་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called display through perceiving the vision in one instant of the manifestation of the miracles of the attainment of buddhahood in all world realms.

source: སངས་རྒྱས་བྱུང་བ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པས་གང་གིས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་བགོས་པར་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called equality through attaining the radiance of the wisdom and miraculous display of the wheel of the Dharma by all the buddhas who have appeared.

source: རང་གིས་སེམས་དང་བསམ་པ་ལ་བལྟས་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྣང་བ་རབ་ཏུ་ཐོབ་པས། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་སེམས་ཀྱིས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called mind through the vision of their own mind and thoughts attaining the radiance of all the tathāgatas.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱིས་ལས་རྣམ་པ་ཇི་ལྟ་བུར་བསྩགས་པའི་གཟུགས་བརྙན་ཡོངས་སུ་སྟོན་པས། གང་གིས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ལས་ཀྱིས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called karma through the vision of the images of the karma that has been accumulated by all beings.

source: ཆོས་ཀྱི་དབྱིངས་མ་ལུས་པ་ཐམས་ཅད་པད་མོའི་ཚལ་གྱིས་རྒྱས་པར་སངས་རྒྱས་རྣམ་པར་འཕྲུལ་པ་རྒྱ་ཆེན་པོ་སྟོན་པ། ཕྱོགས་ཀུན་ཏུ་མངོན་སུམ་དུ་དམིགས་པས། གང་གིས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་རྣམ་པར་འཕྲུལ་པས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called miracles through the direct perception in all directions of the vision of the buddhas miraculously filling the entirety of the realm of phenomena with a vast bed of lotuses.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བརྙན་གྱི་སྤྲིན་དབྱངས་སྒྲོགས་པས་ཆོས་ཀྱི་དབྱིངས་དང་ནམ་མཁའ་ཀུན་ནས་སྣང་བ། གང་གིས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སྒོ་ནམ་མཁས་སྒྲོ་བཏགས་པ་རབ་ཏུ་ཐོབ་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “They are the ones who have attained the gateway of mindfulness of the buddhas called space through seeing the formation of clouds of the forms of the tathāgatas, resounding with their voices, throughout space in the realm of phenomena.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཕྱོགས་ཀྱི་ལྗོངས་རྒྱ་མཚོའི་སྒོ་ཞེས་བྱ་བ་ཡོད་པ་དེ་ན།
en: In this southern region there is a district called Sāgara­mukha.

source: དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་ཅེས་བྱ་བ་འདུག་གི །
en: There dwells a bhikṣu by the name of Sāgara­megha.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: Go to him and ask him, ‘How does a bodhisattva train in bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག་དང་།
en: How does a bodhisattva practice it?’

source: རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་དེ་ཁྱོད་ལ་དགེ་བའི་རྩ་བའི་ཚོགས་དང་།
en: “Noble one, that kalyāṇamitra will explain it to you.

source: རྒྱུ་ཡོངས་སུ་སྟོན་པར་འགྱུར་རོ། །
en: He will reveal to you the cause of the accumulation of merit.

source: ཚོགས་ཀྱིས་རྒྱ་ཆེན་པོ་ཡང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: He will make you understand the level of vast accumulation.

source: དགེ་བའི་རྩ་བའི་སྟོབས་དང་། ཤུགས་རྒྱ་ཆེན་པོ་ཡང་ཡོངས་སུ་སྐྱེད་པར་བྱེད་དོ། །
en: He will describe the vast power and might of roots of merit.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཚོགས་དང་རྒྱུ་རྒྱ་ཆེན་པོ་ཡང་ཡོངས་སུ་བརྗོད་པར་འགྱུར་རོ། །ཐེག་པ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ་དང་།
en: He will make known to you the vast cause for the accumulation of the aspiration to enlightenment.

source: སྣང་བར་འགྱུར་བ་རྒྱ་ཆེན་པོ་ཡང་བསྐྱེད་པར་བྱེད་དོ། །
en: He will provide the basis for the cause of the great radiance of the Mahāyāna.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚོགས་ཀྱི་སྟོབས་རྒྱ་ཆེན་པོ་ཡང་རབ་ཏུ་སྟོན་པར་བྱེད་དོ། །
en: He will enable in you the vast power of the accumulation of the perfections.

source: སྤྱོད་པ་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཚུལ་རྒྱ་ཆེན་པོ་ཡང་རབ་ཏུ་རྗོད་པར་འགྱུར་རོ། །
en: He will enable you to purify your entry into the vast ocean of conduct.

source: སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་རྒྱ་ཆེན་པོ་ཡང་ཡོངས་སུ་སྦྱོང་བར་འགྱུར་རོ། །
en: He will enable you to purify a vast domain of aspirations.

source: སྒོ་ཀུན་ནས་འབྱུང་བའི་རྒྱན་རྒྱ་ཆེན་པོ་ཡང་རྣམ་པར་སྦྱོང་བར་འགྱུར་རོ། །
en: He will enable you to develop vast displays that emerge from everywhere.

source: སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་རྒྱ་ཆེན་པོ་ཡང་ཡོངས་སུ་འཕེལ་བར་བྱེད་དོ། །
en: He will augment the vast power of great compassion.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་སྤྲིན་གྱི་དཔལ་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། དགེ་སློང་སྤྲིན་གྱི་དཔལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ལན་བརྒྱ་སྟོང་དུ་མར་ཕྱིར་བལྟས་ནས། དགེ་སློང་སྤྲིན་གྱི་དཔལ་གྱི་དྲུང་ནས་སོང་ངོ་།། །།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Meghaśrī, circumambulated the bhikṣu Meghaśrī a hundred thousand times, keeping him to his right, and, looking back a hundred thousand times, departed from the bhikṣu Meghaśrī.

source: སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་ཉི་ཤུ་བརྒྱད་པ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དེ་བཞིན་རྗེས་སུ་བསམ་པ་དང་།
en: Sāgara­megha Chapter 5 Then Sudhana, the head merchant’s son, contemplated the instruction of that kalyāṇamitra.

source: ཡེ་ཤེས་སྣང་བ་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་།
en: He remembered the radiance of his wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དེ་རྣམ་པར་དཔྱད་པ་དང་།
en: He analyzed that bodhisattva’s liberation.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་དེ་རྗེས་སུ་སྦྱང་བ་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོའི་ཚུལ་དེ་བལྟ་བ་དང་།
en: He reflected on the bodhisattva’s way of samādhi. He looked at the way of an ocean of bodhisattvas.

source: སངས་རྒྱས་ཀྱི་དཀྱིལ་འཁོར་དེ་ལ་མངོན་པར་མོས་པར་བྱ་བ་དང་།
en: He aspired toward the domain of buddhahood.

source: སངས་རྒྱས་བལྟ་བའི་ཕྱོགས་དེ་ལ་མངོན་པར་སྤྲོ་བར་བྱ་བ་དང་།
en: He delighted in the direction of the vision of the buddhas.

source: སངས་རྒྱས་རྒྱ་མཚོ་དེ་ལ་རྗེས་སུ་བསམ་པ་དང་།
en: He contemplated the ocean of buddhas.

source: སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་།
en: He remembered the succession of buddhas.

source: སངས་རྒྱས་ཀྱི་ཚུལ་རྟོགས་པར་བྱ་བ་དེ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་།
en: He comprehended that which is understood in the way of the buddhas.

source: སངས་རྒྱས་ཀྱི་ནམ་མཁའ་དེ་ལ་རྗེས་སུ་བལྟ་བར་བྱེད་ཅིང་།
en: He looked into the sky of the buddhas.

source: མཐར་གྱིས་ཕྱོགས་ཀྱིས་ལྗོངས་རྒྱ་མཚོའི་སྒོ་གང་ན་བ་དང་། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Eventually he arrived in the area called Sāgara­mukha and went to where the bhikṣu Sāgara­megha was.

source: དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་ཞུགས་ཏེ།
en: He bowed his head to the feet of the bhikṣu Sāgara­megha, circumambulated him many hundreds of thousands of times, keeping him to his right, sat before him, and with palms together said, “Ārya, I am set on the highest, complete enlightenment.

source: བླ་ན་མེད་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་ལ་འཇུག་པར་འཚལ་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཇིག་རྟེན་གྱི་རྒྱུད་ལས་ཕྱིར་ལྡོག་ཅིང་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་འགྲུབ་པར་འགྱུར་བ་དང་། འཁོར་བའི་རྒྱ་མཚོ་ལས་རྒལ་ཞིང་ཐམས་ཅད་མཁྱེན་པའི་རྒྱ་མཚོར་འཇུག་པར་འགྱུར་བ་དང་། བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་གྱེན་དུ་འཕགས་པར་འགྱུར་ཞིང་། དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་འགྲུབ་པར་འགྱུར་བ་དང་། འཁོར་བའི་རྒྱུད་ལས་ལྡོག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱུད་དུ་འཇུག་པར་འགྱུར་བ་དང་། འཁོར་བའི་རྒྱ་མཚོ་རྒྱུད་ཀྱི་འཁོར་ལོ་ལས་ཕྱིར་ལྡོག་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་འཁོར་ལོར་འཇུག་པར་འགྱུར་བ་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རབ་ཏུ་འཇོམས་ཤིང་སངས་རྒྱས་ཀྱི་དཀྱིལ་འཁོར་འབྱུང་བ་ཐམས་ཅད་རབ་ཏུ་སྟོན་པ་དང་།
en: I seek to enter the ocean of the highest wisdom.

source: སྲིད་པའི་རྒྱ་མཚོ་ཡོངས་སུ་སྐེམས་ཤིང་སྙིང་རྗེ་ཆེན་པོའི་མཚོ་རྣམ་པར་འཕེལ་བར་བྱེད་པ་དང་། མི་ཁོམ་པ་དང་ངན་སོང་དང་། ངན་འགྲོ་དང་ལོག་པར་ལྟུང་བ་ཐམས་ཅད་ཀྱི་སྒོ་གཅོད་ཅིང་། མཐོ་རིས་དང་མྱ་ངན་ལས་འདས་པའི་སྒོ་འབྱེད་པ་དང་། ཁམས་གསུམ་གྱི་གྲོང་ཁྱེར་གྱི་སྒོ་རྣམ་པར་གཅོད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕོ་བྲང་གི་སྒོ་རྣམ་པར་འབྱེད་པ་དང་། ཡོ་བྱད་ཐམས་ཅད་ཀྱི་སྲེད་པ་རྣམ་པར་སྤོང་ཞིང་འགྲོ་བ་ཐམས་ཅད་བསྡུ་བའི་སྨོན་ལམ་ཡོངས་སུ་བསྐྱེད་པར་འགྱུར་བ་མ་འཚལ་ལོ། །
en: However, I do not know how bodhisattvas turn away from worldly existences and attain the family of the tathāgatas; how they cross the ocean of existence and enter the ocean of omniscience; how they transcend the level of foolish, ordinary beings and attain the family of the tathāgatas; how they turn away from the flow of saṃsāra and enter the flow of bodhisattva conduct; how they turn back from the wheel of the continuum of saṃsāra’s ocean and enter the wheel of bodhisattva conduct and aspiration; how they defeat all the domains of the māras and manifest the arising of all the domains of the buddhas; how they dry up the ocean of existences and expand the ocean of great compassion; how they shut the gateway to all unfortunate existences, lower existences, and downfalls and open the gateway to the higher existences and nirvāṇa; how they destroy the gateway to the city of the three realms and open the gateway to the palace of omniscience; how they reject craving for all things and develop the aspiration to gather all beings.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །
en: After he had said that, the bhikṣu Sāgara­megha said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ནི་བྱང་ཆུབ་ཏུ་སེམས་ཀྱང་མི་སྐྱེ་བའི་དགེ་བའི་རྩ་བ་སྒོ་ཀུན་ཏུ་སྣང་བ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “Noble one, the beings who have not planted roots of merit do not develop the aspiration for enlightenment.

source: ཐབས་ཀྱི་སྙིང་པོ་དང་ལྡན་པའི་ལམ་གྱི་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་སྣང་བས་རབ་ཏུ་སྣང་བར་འགྱུར་བ་དང་། བསོད་ནམས་ཀྱི་རྒྱ་མཚོའི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པ་དང་། དཀར་པོའི་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱུན་མི་འཆད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་བཀུར་བས་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་དང་། ལུས་དང་སྲོག་ལ་འཕངས་པ་མི་རྩི་བ་དང་། དངོས་པོར་འཛིན་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། མཐོན་དམན་མེད་པའི་ས་ལྟར་སེམས་མཉམ་པ་དང་།
en: “The aspiration for enlightenment is developed by those beings who have attained the complete illumination, by the roots of merit, of all gateways, who are illuminated by the light of the wisdom of the samādhi of the path that has the essence of methods, who have accumulated a vast accumulation of an ocean of merit, who have a continuity of all good actions, who never tire of relying on all the kalyāṇamitras, who have no concern for their own bodies or lives, who are free from all fixation on things, whose minds are as even as completely level ground, who possess a nature of compassion and kindness, who are focused on all those dwelling in the states of existence, and who long for the scope of activity of the tathāgatas.

source: རང་བཞིན་གྱི་སྙིང་རྗེ་ཆེ་ཞིང་བྱམས་པར་སེམས་པ་དང་ལྡན་པ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་གནས་པར་འདུག་པ་དང་།
en: “In other words, they have developed a motivation of great compassion so as to protect all beings.

source: དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་མངོན་པར་མོས་པའི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེ་སྟེ། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་སེམས་དང་འགྲོ་བ་ཐམས་ཅད་ལ་སྙོམས་པར་ནན་ཏན་དུ་བྱ་བའི་ཕྱིར་བྱམས་པ་ཆེན་པོའི་སེམས་དང་།
en: They have developed a motivation of great love so as to treat all beings equally.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཞི་བར་བྱ་བའི་ཕྱིར་བདེ་བའི་སེམས་དང་།
en: They have developed the motivation to bring happiness so as to bring to an end the mass of suffering of all beings.

source: མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་བཟློག་པའི་ཕྱིར་ཕན་པའི་སེམས་དང་།
en: They have developed the motivation to bring benefit so as to turn beings away from all bad qualities.

source: འཇིགས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་སྙིང་བརྩེ་བའི་སེམས་དང་།
en: They have developed the motivation of sympathy so as to protect from all fear.

source: བསྒྲིབས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་ཕྱིར་ཆགས་པ་མེད་པའི་སེམས་དང་།
en: They have developed the motivation of nonattachment so as to eliminate all obscurations.

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་དགང་བའི་ཕྱིར།
en: They have developed a vast motivation so as to pervade the entire realm of phenomena.

source: རྒྱ་ཆེན་པོའི་སེམས་དང་ནམ་མཁའི་དབྱིངས་ཀུན་ཏུ་གཞོལ་ཞིང་ཀུན་ཏུ་འགྲོ་བར་བྱ་བའི་ཕྱིར་མཐའ་ཡས་པའི་སེམས་དང་།
en: They have developed an infinite motivation so as to extend throughout and be present everywhere in the realm of space.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་ཞིང་རྣམ་པར་དམིགས་པར་བྱ་བའི་ཕྱིར་དྲི་མ་མེད་པའི་སེམས་དང་།
en: They have developed a stainless motivation so as to perceive the vision of all the tathāgatas.

source: དུས་གསུམ་གྱི་དམིགས་པ་མ་ལུས་པར་ཡེ་ཤེས་ཀྱིས་རྒྱས་པར་དགང་བའི་ཕྱིར་རྣམ་པར་དག་པའི་སེམས་དང་།
en: They have developed a pure motivation in order for their wisdom to extend throughout the three times without exception.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཡེ་ཤེས་ཀྱི་སེམས་ཀྱང་སྐྱེ་བར་འགྱུར་རོ། །
en: They have developed a motivation for wisdom in order to dispel wisdom’s obscurations and enter into an ocean of omniscient wisdom.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་ཕྱོགས་ཀྱི་ལྗོངས་རྒྱ་མཚོའི་སྒོ་འདིར་ལོ་བཅུ་གཉིས་སུ་རྒྱ་མཚོ་ཆེན་པོ་འདི་ལ་དམིགས་ཏེ། མངོན་དུ་བྱས་ནས་འདི་ལྟར་རྒྱ་མཚོ་རྒྱ་ཆེ་ཞིང་ཚད་མེད་པ་ལ་རྗེས་སུ་བསམ་པ་དང་། དྲི་མ་མེད་ཅིང་དང་བ་དང་། ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་དང་། བགས་ཀྱིས་གཞོལ་ཞིང་ལེགས་པར་གནས་པ་དང་། རིན་པོ་ཆེའི་འབྱུང་གནས་དུ་མས་རྣམ་པར་བརྒྱན་པ་དང་།
en: “Noble one, for twelve years I have dwelled in this area called Sāgara­mukha.

source: ཆུའི་ཕུང་པོ་ཚད་མེད་པ་དང་། ཁ་དོག་རྣམ་པ་ཐ་དད་པ་མང་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འབྱུང་པོ་མཐའ་ཡས་པའི་གནས་སུ་གྱུར་པ་དང་སྲོག་ཆགས་མང་པོ་སྣ་ཚོགས་ཀྱི་རྟེན་དུ་གྱུར་པ་དང་། སྤྲིན་ཆེན་པོའི་ཆར་ཡོངས་སུ་འཛིན་པ་དང་། གང་ཞིང་འབྲི་བར་འགྱུར་བ་མེད་པ་ལ་རྗེས་སུ་སེམས་པར་བྱེད་ཅིང་གནས་ཏེ།
en: I focused on the great ocean, facing it, and I contemplated the ocean in this way: ‘It is vast and immeasurable; it is stainless and clear; it is deep and unfathomable; it becomes steadily deeper and stays perfectly the same; it is a source of a variety of many jewels; it is a limitless mass of water; it has many different colors and is inconceivable; it has infinite spirits; it is the dwelling place of a multitude of various creatures; it receives the rain from great clouds; and it is neither filled nor diminished.’

source: རིགས་ཀྱི་བུ་དེ་ལ་ཁོ་བོས་འདི་སྙམ་དུ་བསམ་མོ། །འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རྒྱ་མཚོ་ཆེན་པོ་འདི་བས་ཀྱང་འཕགས་པར་རྒྱ་ཆེ་ལ་འདི་བས་ཀྱང་ཡངས་ཤིང་འདི་བས་ཀྱང་ཚད་མེད་ལ།
en: “Noble one, I thought, ‘Is there anything in this world realm that is greater than this ocean?

source: འདི་བས་ཀྱང་ངོ་མཚར་དང་ལྡན་པ་ལ་ལ་ཞིག་ཡོད་དམ་སྙམ་སྟེ།
en: Is there something that is vaster, more measureless, deeper, or more marvelous?’

source: དེ་ལྟར་ཁོ་བོ་ཚུལ་བཞིན་དུ་བསམ་པ་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པར་གནས་པའི་ཚེ།
en: While I was engaged in attention to this through contemplation, there appeared a great lotus from under the great ocean.

source: རྒྱ་མཚོ་ཆེན་པོའི་འོག་གི་གཞི་ལས་པད་མོ་ཆེན་པོ་ནོར་བུ་རིན་པོ་ཆེ་ཨིནྡྲ་ནཱི་ལ་ཐུབ་པ་མེད་ཅིང་རྡོ་རྗེ་ལྟ་བུར་སྲ་བའི་ཆུ་བ་ཅན།
en: It had a stem of unsurpassable precious sapphire jewels that was as hard as diamond.

source: ནོར་བུ་རིན་པོ་ཆེ་བཻཌཱུཪྻ་དམ་པའི་རྒྱན་དང་ལྡན་པ།
en: It was adorned with great precious beryl jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལྟར་དྲི་མ་མེད་པའི་ལོ་མ་རྒྱ་ཆེན་པོ་ཅན། དུས་དང་མཐུན་པའི་ཙན་དན་གྱི་སྙིང་པོའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: It had vast leaves of stainless Jambu River gold.

source: རིན་པོ་ཆེ་ཨ་སྨ་གར་བྷའི་ཟེ་བ་ཅན།
en: It displayed a yellow sandalwood pericarp and stamens of emerald jewels.

source: རྒྱ་མཚོ་ཙམ་དུ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྡོང་པོའི་ལྷུན་ནས་བཟུང་བ།
en: It was as vast and large as the ocean. A gathering of a million asura lords held the stem.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་བརྒྱ་ཕྲག་སྟོང་གི་དྲ་བས་ཀུན་ནས་ཡོག་པ།
en: It was covered from above by a network of a million various jewels.

source: ཀླུ་ཡི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྤོས་ཆུའི་ཆར་མངོན་པར་ཕབ་པ།
en: A million nāga lords sent down a rain of incense.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་དར་དང་རིན་པོ་ཆེའི་ལྡ་ལྡི་དང་སེ་མོ་དོ་མང་པོ་མཆུས་བཟུང་ཞིང་རབ་ཏུ་སྤྱངས་པ་མིའམ་ཅིའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཕན་པའི་སེམས་ཀྱིས་ཀུན་ནས་བལྟ་བ།
en: A million garuḍa lords hung from their beaks streamers of silk and strings of jewels. A million kinnara lords looked on with a wish to benefit.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་འཁོར་ནས་མངོན་པར་འདུད་པ།
en: A million mahoraga lords encircled the lotus and bowed down to it.

source: སྲིན་པོའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ལུས་འདུད་ཅིང་མངོན་པར་མཆོད་པ།
en: A million rākṣasa lords bowed down and made offerings to it.

source: དྲི་ཟའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རོལ་མོ་དང་གླུ་སྣ་ཚོགས་སྙན་པས་བསྟོད་ཅིང་མཆོད་པ།
en: A million gandharva lords played music and sang various melodious songs in praise and as an offering.

source: ལྷའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། སྤོས་དང་ཕྲེང་བ་དང་། བདུག་སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་།
en: A million deva lords sent down rain from clouds of divine flowers, perfume, garlands, incense, ointments, powders, clothing, parasols, banners, and divine flags.

source: རྒྱལ་མཚན་དང་། ལྷའི་བ་དན་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་པ། ཚངས་པའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྤྱི་བོས་གཏུགས་ཏེ། ཕྱག་འཚལ་ཞིང་མཆོད་པ།
en: A million Brahmakāyika lords reverently bowed their heads, paid homage, and made offerings.

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཐལ་མོ་སྦྱར་ཅིང་ཕྱག་བྱ་བ།
en: A million Śuddhāvāsa devas placed their palms together and paid homage.

source: མིའི་དབང་པོ་འཁོར་ལོས་སྒྱུར་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རིན་པོ་ཆེ་བདུན་གྱིས་བསུ་ཞིང་མངོན་པར་མཆོད་པ། རྒྱ་མཚོའི་ལྷ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མངོན་པར་མཐོན་ཅིང་ཕྱག་བྱ་བ།
en: A million cakravartins, lords of humans, welcomed it with an offering of the seven jewels, and a million ocean devas rose up and paid homage to it.

source: ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་དད་བརྒྱ་སྟོང་ཕྲག་བཅུས་འོད་ཟེར་གྱི་རྒྱན་གྱིས་རབ་ཏུ་སྣང་བར་བྱས་པ།
en: “A million precious asteria jewels displaying light rays adorned it.

source: ནོར་བུ་རིན་པོ་ཆེ་བསོད་ནམས་ཀྱིས་དག་པ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མཁོས་སུ་ཕེབས་པར་འཕེལ་བས་རབ་ཏུ་བརྒྱན་པ།
en: A million perfectly arranged precious jewels of pure merit beautified it.

source: ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྙིང་པོ་རབ་ཏུ་གསལ་བར་བྱས་པ།
en: A million radiant precious jewels were its stainless center.

source: ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་སྙིང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་དཔལ་ཆེན་པོ་ཤིན་ཏུ་འབར་བར་གྱུར་པ།
en: It blazed with a million glorious precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེའི་མཛོད་སྣང་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མཐའ་ཡས་པར་སྣང་བར་བྱས་པ།
en: It had the infinite shining of a million variegated treasures of precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་འཛམ་བུའི་ཆུ་ཀླུང་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཡོངས་སུ་སྟོན་པར་གནས་པས་རབ་ཏུ་བརྒྱན་པ།
en: It was beautified by a perfectly arranged display of a million precious Jambudvīpa jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་རྡོ་རྗེའི་སེང་གེ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཐུབ་པ་མེད་པར་བརྒྱན་པ།
en: It had an unsurpassable display of a million precious diamond jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་ཉི་མའི་སྙིང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རྒྱ་ཆེར་གསལ་བར་བསྒྲུབས་པ།
en: It had a plenitude of illustrious blazing precious sunstone jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་འབར་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཁ་དོག་སྣ་ཚོགས་སུ་བརྒྱན་པ།
en: It had an arrangement of a million radiant precious jewels of various colors.

source: ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མི་ཟད་པའི་རྒྱན་དང་འོད་འབར་བར་བྱས་པ་བྱུང་སྟེ།
en: It had the unceasingly brightly shining display of a million precious wish-fulfilling kings of jewels.

source: པདྨ་ཆེན་པོ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བ་ལས་བྱུང་བའོ། །བྱང་ཆུབ་སེམས་དཔའི་བསམ་པས་ཡོངས་སུ་བརྟན་པའོ། །
en: “That great lotus had arisen from a tathāgata’s transcendent roots of merit and remained through the aspiration of bodhisattvas.

source: ཕྱོགས་ཐམས་ཅད་དུ་མངོན་པར་དམིགས་སུ་ཡོད་པའོ། །
en: It could be perceived in all directions.

source: སྒྱུ་མའི་རྣམ་པའི་ཆོས་ཀྱིས་བྱུང་བའོ། །
en: It had come forth as an illusory phenomenon.

source: རྗེན་པའི་དྲི་མ་མེད་པའི་ལས་ཀྱིས་བྱུང་བའོ། །
en: It had been created from pure, stainless actions.

source: ཉོན་མོངས་པ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་གྱིས་བརྒྱན་པའོ། །
en: It was the display of the unalloyed true nature.

source: རྨི་ལམ་ལྟ་བུའི་ཆོས་ཉིད་ཀྱིས་ཡོངས་སུ་བྱུང་བའོ། །
en: It was produced like a phenomenon in a dream.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་གྱིས་རྒྱས་བཏབ་པའོ། །
en: It was sealed as being a noncomposite phenomenon.

source: ཆགས་པ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་དང་ལྡན་པའོ། །
en: It possessed the nature of being free of attachment.

source: ཕྱོགས་ཀྱི་ཁམས་ཀུན་ཏུ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པའོ། །
en: It pervaded the domains of the directions throughout the vast realm of phenomena.

source: སངས་རྒྱས་ཀྱི་ཡུལ་བརྗོད་པ་དང་མཐུན་པ་སྟེ།
en: It accorded with the majestic radiance of the domain of buddhahood.
